/**
* \version 1.0
* \author bazhen.levkovets
* \date 2019 
*************************************************************************************
* \copyright	Bazhen Levkovets
* \copyright	Brovary
* \copyright	Ukraine
*************************************************************************************
*/

/*
**************************************************************************
*							INCLUDE FILES
**************************************************************************
*/

#include "flash_stm32f103_hal_sm.h"

/*
**************************************************************************
*							LOCAL DEFINES
**************************************************************************
*/


/*
**************************************************************************
*							LOCAL CONSTANTS
**************************************************************************
*/


/*
**************************************************************************
*						    LOCAL DATA TYPES
**************************************************************************
*/


/*
**************************************************************************
*							  LOCAL TABLES
**************************************************************************
*/

/*
**************************************************************************
*								 MACRO'S
**************************************************************************
*/


/*
**************************************************************************
*						 LOCAL GLOBAL VARIABLES
**************************************************************************
*/

/*
**************************************************************************
*                        LOCAL FUNCTION PROTOTYPES
**************************************************************************
*/

uint8_t Flash_Ready(void);

/*
**************************************************************************
*                           GLOBAL FUNCTIONS
**************************************************************************
*/

uint32_t Flash_Read(uint32_t address) {
  return (*(__IO uint32_t*) address);
}
/**********************************************************************/

//Ð¤ÑƒÐ½ÐºÑ†Ð¸Ñ� Ð²Ð¾Ð·Ð²Ñ€Ñ‰Ð°ÐµÑ‚ true ÐºÐ¾Ð³Ð´Ð° Ð¼Ð¾Ð¶Ð½Ð¾ Ñ�Ñ‚Ð¸Ñ€Ð°Ñ‚ÑŒ Ð¸Ð»Ð¸ Ð¿Ð¸Ñ�Ð°Ñ‚ÑŒ Ð¿Ð°Ð¼Ñ�Ñ‚ÑŒ.
uint8_t Flash_Ready(void) {
  return !(FLASH->SR & FLASH_SR_BSY);
  // but read next
  // https://habr.com/ru/post/213771/
}
/**********************************************************************/


void Flash_Erase_All_Pages(void) {
  FLASH->CR |= FLASH_CR_MER; //Ð£Ñ�Ñ‚Ð°Ð½Ð°Ð²Ð»Ð¸Ð²Ð°ÐµÐ¼ Ð±Ð¸Ñ‚ Ñ�Ñ‚Ð¸Ñ€Ð°Ð½Ð¸Ñ� Ð’Ð¡Ð•Ð¥ Ñ�Ñ‚Ñ€Ð°Ð½Ð¸Ñ†
  FLASH->CR |= FLASH_CR_STRT; //Ð�Ð°Ñ‡Ð°Ñ‚ÑŒ Ñ�Ñ‚Ð¸Ñ€Ð°Ð½Ð¸Ðµ
  while(!Flash_Ready()) // ÐžÐ¶Ð¸Ð´Ð°Ð½Ð¸Ðµ Ð³Ð¾Ñ‚Ð¾Ð²Ð½Ð¾Ñ�Ñ‚Ð¸.. Ð¥Ð¾Ñ‚Ñ� Ð¾Ð½Ð¾ ÑƒÐ¶Ðµ Ð½Ð°Ð²ÐµÑ€Ð½Ð¾Ðµ Ð½Ð¸ Ðº Ñ‡ÐµÐ¼Ñƒ Ð·Ð´ÐµÑ�ÑŒ...
    ;
  FLASH->CR &= FLASH_CR_MER;
}
/**********************************************************************/

//Ð¤ÑƒÐ½ÐºÑ†Ð¸Ñ� Ñ�Ñ‚Ð¸Ñ€Ð°ÐµÑ‚ Ð¾Ð´Ð½Ñƒ Ñ�Ñ‚Ñ€Ð°Ð½Ð¸Ñ†Ñƒ. Ð’ ÐºÐ°Ñ‡ÐµÑ�Ñ‚Ð²Ðµ Ð°Ð´Ñ€ÐµÑ�Ð° Ð¼Ð¾Ð¶Ð½Ð¾ Ð¸Ñ�Ð¿Ð¾Ð»ÑŒÐ·Ð¾Ð²Ð°Ñ‚ÑŒ Ð»ÑŽÐ±Ð¾Ð¹
//Ð¿Ñ€Ð¸Ð½Ð°Ð´Ð»ÐµÐ¶Ð°Ñ‰Ð¸Ð¹ Ð´Ð¸Ð°Ð¿Ð°Ð·Ð¾Ð½Ñƒ Ð°Ð´Ñ€ÐµÑ�Ð¾Ð² Ñ‚Ð¾Ð¹ Ñ�Ñ‚Ñ€Ð°Ð½Ð¸Ñ†Ðµ ÐºÐ¾Ñ‚Ð¾Ñ€ÑƒÑŽ Ð½ÑƒÐ¶Ð½Ð¾ Ð¾Ñ‡Ð¸Ñ�Ñ‚Ð¸Ñ‚ÑŒ.
void Flash_Erase_Page(uint32_t address) {
  FLASH->CR|= FLASH_CR_PER; //Ð£Ñ�Ñ‚Ð°Ð½Ð°Ð²Ð»Ð¸Ð²Ð°ÐµÐ¼ Ð±Ð¸Ñ‚ Ñ�Ñ‚Ð¸Ñ€Ð°Ð½Ð¸Ñ� Ð¾Ð´Ð½Ð¾Ð¹ Ñ�Ñ‚Ñ€Ð°Ð½Ð¸Ñ†Ñ‹
  FLASH->AR = address; // Ð—Ð°Ð´Ð°ÐµÐ¼ ÐµÑ‘ Ð°Ð´Ñ€ÐµÑ�
  FLASH->CR|= FLASH_CR_STRT; // Ð—Ð°Ð¿ÑƒÑ�ÐºÐ°ÐµÐ¼ Ñ�Ñ‚Ð¸Ñ€Ð°Ð½Ð¸Ðµ
  while(!Flash_Ready())
    ;  //Ð–Ð´ÐµÐ¼ Ð¿Ð¾ÐºÐ° Ñ�Ñ‚Ñ€Ð°Ð½Ð¸Ñ†Ð° Ñ�Ð¾Ñ‚Ñ€ÐµÑ‚Ñ�Ñ�.
  FLASH->CR&= ~FLASH_CR_PER; //Ð¡Ð±Ñ€Ð°Ñ�Ñ‹Ð²Ð°ÐµÐ¼ Ð±Ð¸Ñ‚ Ð¾Ð±Ñ€Ð°Ñ‚Ð½Ð¾
}
/**********************************************************************/

void Flash_Write(uint32_t address,uint32_t data) {
  FLASH->CR |= FLASH_CR_PG; //Ð Ð°Ð·Ñ€ÐµÑˆÐ°ÐµÐ¼ Ð¿Ñ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ð¸Ñ€Ð¾Ð²Ð°Ð½Ð¸Ðµ Ñ„Ð»ÐµÑˆÐ°
  while(!Flash_Ready()) //ÐžÐ¶Ð¸Ð´Ð°ÐµÐ¼ Ð³Ð¾Ñ‚Ð¾Ð²Ð½Ð¾Ñ�Ñ‚Ð¸ Ñ„Ð»ÐµÑˆÐ° Ðº Ð·Ð°Ð¿Ð¸Ñ�Ð¸
    ;
//  *(__IO uint16_t*)address = (uint16_t)data; //ÐŸÐ¸ÑˆÐµÐ¼ Ð¼Ð»Ð°Ð´ÑˆÐ¸Ðµ 2 Ð±Ð°Ñ‚Ð°
//  while(!Flash_Ready())
//    ;
//  address+=2;
//  data>>=16;
//  *(__IO uint16_t*)address = (uint16_t)data; //ÐŸÐ¸ÑˆÐµÐ¼ Ñ�Ñ‚Ð°Ñ€ÑˆÐ¸Ðµ 2 Ð±Ð°Ð¹Ñ‚Ð°

  HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, (uint64_t)data);

  while(!Flash_Ready())
    ;
  FLASH->CR &= ~(FLASH_CR_PG); //Ð—Ð°Ð¿Ñ€ÐµÑ‰Ð°ÐµÐ¼ Ð¿Ñ€Ð¾Ð³Ñ€Ð°Ð¼Ð¼Ð¸Ñ€Ð¾Ð²Ð°Ð½Ð¸Ðµ Ñ„Ð»ÐµÑˆÐ°
}
/**********************************************************************/


/*
**************************************************************************
*                           LOCAL FUNCTIONS
**************************************************************************
*/
