/**
* \version 1.0
* \author bazhen.levkovets
* \date 2019 
*************************************************************************************
* \copyright	Bazhen Levkovets
* \copyright	Brovary
* \copyright	Ukraine
*************************************************************************************
*/

/*
**************************************************************************
*							INCLUDE FILES
**************************************************************************
*/

#include "flash_stm32f103_hal_sm.h"

/*
**************************************************************************
*							LOCAL DEFINES
**************************************************************************
*/


/*
**************************************************************************
*							LOCAL CONSTANTS
**************************************************************************
*/


/*
**************************************************************************
*						    LOCAL DATA TYPES
**************************************************************************
*/


/*
**************************************************************************
*							  LOCAL TABLES
**************************************************************************
*/

/*
**************************************************************************
*								 MACRO'S
**************************************************************************
*/


/*
**************************************************************************
*						 LOCAL GLOBAL VARIABLES
**************************************************************************
*/

/*
**************************************************************************
*                        LOCAL FUNCTION PROTOTYPES
**************************************************************************
*/

uint8_t Flash_Ready(void);

/*
**************************************************************************
*                           GLOBAL FUNCTIONS
**************************************************************************
*/

uint32_t Flash_Read(uint32_t address)
{
  return (*(__IO uint32_t*) address);
}
/**********************************************************************/

//Функция возврщает true когда можно стирать или писать память.
uint8_t Flash_Ready(void)
{
  return !(FLASH->SR & FLASH_SR_BSY);
  // but read next
  // https://habr.com/ru/post/213771/
}
/**********************************************************************/


void Flash_Erase_All_Pages(void)
{
  FLASH->CR |= FLASH_CR_MER; //Устанавливаем бит стирания ВСЕХ страниц
  FLASH->CR |= FLASH_CR_STRT; //Начать стирание
  while(!Flash_Ready()) // Ожидание готовности.. Хотя оно уже наверное ни к чему здесь...
    ;
  FLASH->CR &= FLASH_CR_MER;
}
/**********************************************************************/

//Функция стирает одну страницу. В качестве адреса можно использовать любой
//принадлежащий диапазону адресов той странице которую нужно очистить.
void Flash_Erase_Page(uint32_t address)
{
  FLASH->CR|= FLASH_CR_PER; //Устанавливаем бит стирания одной страницы
  FLASH->AR = address; // Задаем её адрес
  FLASH->CR|= FLASH_CR_STRT; // Запускаем стирание
  while(!Flash_Ready())
    ;  //Ждем пока страница сотрется.
  FLASH->CR&= ~FLASH_CR_PER; //Сбрасываем бит обратно
}
/**********************************************************************/

void Flash_Write(uint32_t address,uint32_t data)
{
  FLASH->CR |= FLASH_CR_PG; //Разрешаем программирование флеша
  while(!Flash_Ready()) //Ожидаем готовности флеша к записи
    ;
//  *(__IO uint16_t*)address = (uint16_t)data; //Пишем младшие 2 бата
//  while(!Flash_Ready())
//    ;
//  address+=2;
//  data>>=16;
//  *(__IO uint16_t*)address = (uint16_t)data; //Пишем старшие 2 байта

  HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, (uint64_t)data);

  while(!Flash_Ready())
    ;
  FLASH->CR &= ~(FLASH_CR_PG); //Запрещаем программирование флеша
}
/**********************************************************************/


/*
**************************************************************************
*                           LOCAL FUNCTIONS
**************************************************************************
*/
